In [48]:
import pandas as pd
import numpy as np

In [49]:
#It is summertime, I am coming back to Python with a high spirit, and with no preassure
#I will create a table with the appropiate values to check the independency of the data

In [50]:
#First I generate the data, according to the lab indications
lista=[]
for i in range (324):
    a=('man','yes')
    lista.append(a)
for i in range (351):
    a=('woman','yes')
    lista.append(a)
for i in range (156):
    a=('man','no')
    lista.append(a)
for i in range (169):
    a=('woman','no')
    lista.append(a)

In [51]:
#I trasnform the list into an array
array=np.array(lista)

In [52]:
#I transform the array into a df
table_df=pd.DataFrame(array)

In [53]:
#I rename the columns
table_df.columns=['Gender','Answer']

In [54]:
display(table_df)
#it looks ok

    Gender Answer
0      man    yes
1      man    yes
2      man    yes
3      man    yes
4      man    yes
..     ...    ...
995  woman     no
996  woman     no
997  woman     no
998  woman     no
999  woman     no

[1000 rows x 2 columns]

In [55]:
# I get the total values per answer
t1=table_df.groupby('Answer').count().reset_index()

In [56]:
display(t1)

  Answer  Gender
0     no     325
1    yes     675

In [57]:
# I get the total values per gender
t2=table_df.groupby(['Gender']).count().reset_index()

In [58]:
display(t2)

  Gender  Answer
0    man     480
1  woman     520

In [59]:
# I get a table with the "yes" answer, by gender
table_df[table_df["Answer"]=="yes"].groupby(['Gender']).count().reset_index()

  Gender  Answer
0    man     324
1  woman     351

In [60]:
# I get a table with the "no" answer, by gender
table_df[table_df["Answer"]=="no"].groupby(['Gender']).count().reset_index()

  Gender  Answer
0    man     156
1  woman     169

In [61]:
a=table_df[table_df["Gender"]=="man"].groupby(['Answer']).count().reset_index()

In [62]:
# I rename the columns for clarity
a.rename(columns={'Answer':'answer','Gender':'man'}, inplace=True)

In [63]:
b=table_df[table_df["Gender"]=="woman"].groupby(['Answer']).count().reset_index()

In [64]:
# I rename the columns for clarity
b.rename(columns={'Answer':'answer','Gender':'woman'}, inplace=True)

In [65]:
#I concatenate those tables
table=pd.concat([a, b], axis=1)

In [66]:
display(table)

  answer  man answer  woman
0     no  156     no    169
1    yes  324    yes    351

In [67]:
#I select the columns I want to keep
table_basic = table[["man","woman"]]

In [68]:
display(table_basic)

   man  woman
0  156    169
1  324    351

In [69]:
display(t1)

  Answer  Gender
0     no     325
1    yes     675

In [70]:
#by concatenating those 2 tables I get a column with total answers per answer
table1=pd.concat([table_basic, t1], axis=1)

In [71]:
display (table1)

   man  woman Answer  Gender
0  156    169     no     325
1  324    351    yes     675

In [72]:
# I rename the columns for clarity
table1.rename(columns={'Answer':'answer','Gender':'Total'}, inplace=True)

In [73]:
#I select the columns I want
Final_table=table1[['man','woman','Total']]

In [74]:
# I add a row with totals
Agg_Table=Final_table.append(table1.sum(numeric_only=True), ignore_index=True)

In [75]:
display (Agg_Table)
# It looks nice

   man  woman  Total
0  156    169    325
1  324    351    675
2  480    520   1000

In [76]:
#Now, by slicing properly, I can extract the probability values from the table
Total=Agg_Table.loc[2,"Total"]

In [77]:
print(Total)

1000

In [78]:
P_Man_and_YES=Agg_Table.loc[1,"man"]/Total

In [79]:
print(P_Man_and_YES)

0.324

In [80]:
P_Man=Agg_Table.loc[2,"man"]/Total

In [81]:
print(P_Man)

0.48

In [82]:
P_YES=Agg_Table.loc[1,"Total"]/Total

In [83]:
print(P_YES)

0.675

In [84]:
quotient=P_Man_and_YES/P_Man

In [85]:
print (quotient)

0.675

In [86]:
#and now I can check the independency of the variables